src/test/resources/admin/checkouts/abandoned-checkouts.json

{
  "checkouts": [
    {
      "id": 358330204170,
      "token": "1bd53417bb4a2910cd369019e5c084e1",
      "cart_token": "154014006b440d1d247dc0af011b0532",
      "email": "rdee@icloud.com",
      "gateway": "shopify_payments",
      "buyer_accepts_marketing": false,
      "created_at": "2018-01-30T19:27:47+11:00",
      "updated_at": "2018-02-19T21:59:31+11:00",
      "landing_site": "\/",
      "note": "",
      "note_attributes": [
        {
          "name": "_findify_id",
          "value": "{\"uniq_id\":\"Ae8AzizQQEl2v22T\",\"visit_id\":\"LlL9YXxmnLHTvxr9\"}"
        }
      ],
      "referring_site": "http:\/\/l.instagram.com\/?u=http:\/\/www.mockshop.com\/\u0026e=ATN0z3U9DVMwlrho-YL5hE_Uw6J7cZGWfbWxzMmb1T8tyELa8b4zbAetDtrYk5McsE1VLkUlyAHr77dV",
      "shipping_lines": [
        {
          "code": "Standard Shipping",
          "price": "10.0",
          "source": "shopify",
          "title": "Standard Shipping",
          "phone": null,
          "tax_lines": [],
          "custom_tax_lines": null,
          "validation_context": null,
          "markup": "0.0",
          "delivery_category": null,
          "carrier_identifier": null,
          "carrier_service_id": null,
          "api_client_id": null,
          "requested_fulfillment_service_id": null,
          "applied_discounts": [],
          "id": "5b030d0f232c3d3f0f244467e3733bff"
        }
      ],
      "subtotal_price": "20.00",
      "taxes_included": false,
      "total_discounts": "25.00",
      "total_line_items_price": "45.00",
      "total_price": "32.00",
      "total_tax": "2.00",
      "total_weight": 0,
      "currency": "AUD",
      "completed_at": null,
      "closed_at": null,
      "user_id": null,
      "location_id": null,
      "source_identifier": null,
      "source_url": null,
      "device_id": null,
      "phone": null,
      "customer_locale": "en",
      "line_items": [
        {
          "applied_discounts": [],
          "key": "36744fde4e0f8719a3c67ac1dd976ccc",
          "compare_at_price": null,
          "destination_location_id": 181468809738,
          "fulfillment_service": "manual",
          "gift_card": false,
          "grams": 0,
          "line_price": "45.00",
          "origin_location_id": 3694895278,
          "price": "45.00",
          "product_id": 401505872906,
          "properties": null,
          "quantity": 1,
          "requires_shipping": true,
          "sku": "",
          "tax_lines": [
            {
              "position": 1,
              "price": "2.00",
              "rate": 0.1,
              "title": "GST",
              "source": "Shopify",
              "compare_at": 0.1,
              "zone": "country"
            }
          ],
          "taxable": true,
          "title": "Product 1",
          "variant_id": 1811121115018,
          "variant_title": "",
          "vendor": "mockshop"
        }
      ],
      "name": "#358130204170",
      "source": null,
      "discount_codes": [
        {
          "code": "SHOP25",
          "amount": "25.00",
          "type": "fixed_amount"
        }
      ],
      "abandoned_checkout_url": "https:\/\/www.mockshop.com\/22487151\/checkouts\/1bd53417bb4a3910cd369015e5c084e1\/recover?key=1f68d5595f68e5cd9d4f54f049b414e4",
      "tax_lines": [
        {
          "title": "GST",
          "price": "2.00",
          "rate": 0.1
        }
      ],
      "source_name": "web",
      "billing_address": {
        "first_name": "Rachel",
        "address1": "32 Orange Quays",
        "phone": "",
        "city": "Mandurah",
        "zip": "6080",
        "province": "Western Australia",
        "country": "Australia",
        "last_name": "Dee",
        "address2": "",
        "company": "",
        "latitude": -10.521635,
        "longitude": 11.717312,
        "name": "Rachel Dee ",
        "country_code": "AU",
        "province_code": "WA"
      },
      "shipping_address": {
        "first_name": "Rachel",
        "address1": "32 Orange Quays",
        "phone": "",
        "city": "Mandurah",
        "zip": "6080",
        "province": "Western Australia",
        "country": "Australia",
        "last_name": "Dee ",
        "address2": "",
        "company": "",
        "latitude": -90.521635,
        "longitude": 90.717312,
        "name": "Rachel Dee",
        "country_code": "AU",
        "province_code": "WA"
      },
      "customer": {
        "id": 176087990282,
        "email": "rdee@icloud.com",
        "accepts_marketing": false,
        "created_at": "2018-01-25T09:44:47+11:00",
        "updated_at": "2018-02-01T02:25:16+11:00",
        "first_name": "Rachel",
        "last_name": "Dee",
        "orders_count": 1,
        "state": "disabled",
        "total_spent": "30.50",
        "last_order_id": 236629431946,
        "note": null,
        "verified_email": true,
        "multipass_identifier": null,
        "tax_exempt": false,
        "phone": null,
        "tags": "",
        "last_order_name": "#1160",
        "default_address": {
          "id": 212547272714,
          "customer_id": 176087910482,
          "first_name": "Rachael ",
          "last_name": "Dee ",
          "company": "",
          "address1": "32 Orange Quays",
          "address2": "",
          "city": "Mandurah",
          "province": "Western Australia",
          "country": "Australia",
          "zip": "6080",
          "phone": "",
          "name": "Rachel Dee",
          "province_code": "WA",
          "country_code": "AU",
          "country_name": "Australia",
          "default": true
        }
      }
    },
    {
      "id": 412087877642,
      "token": "d91ef302ef1edvbfc2b3349b9554ea97",
      "cart_token": "daab5a57a86a9c7d7ce2c21b8d4d1c63",
      "email": "Sarah_tan@gmail.com",
      "gateway": null,
      "buyer_accepts_marketing": false,
      "created_at": "2018-02-23T11:37:23+11:00",
      "updated_at": "2018-02-23T12:09:53+11:00",
      "landing_site": "\/",
      "note": "",
      "note_attributes": [
        {
          "name": "_findify_id",
          "value": "{\"uniq_id\":\"wK5z4s4rf4fuB0M3\",\"visit_id\":\"9pskzexsniRydDe5\"}"
        }
      ],
      "referring_site": "http:\/\/l.instagram.com\/?u=http:\/\/www.mockshop.com\/\u0026e=DTOn6yLgVjRu0dXzrM5bZ_24zzFgYTYdu_6net8nULcWKpND5gdQhhBsw-CAAuGI0CBwkrzY-Fn7yu6h1",
      "shipping_lines": [],
      "subtotal_price": "25.00",
      "taxes_included": false,
      "total_discounts": "20.00",
      "total_line_items_price": "45.00",
      "total_price": "27.50",
      "total_tax": "2.50",
      "total_weight": 0,
      "currency": "AUD",
      "completed_at": null,
      "closed_at": null,
      "user_id": null,
      "location_id": null,
      "source_identifier": null,
      "source_url": null,
      "device_id": null,
      "phone": null,
      "customer_locale": "en",
      "line_items": [
        {
          "applied_discounts": [],
          "key": "84fb9d12a3a7ef347251fe01593e5ca8",
          "compare_at_price": null,
          "destination_location_id": 206797013001,
          "fulfillment_service": "manual",
          "gift_card": false,
          "grams": 0,
          "line_price": "45.00",
          "origin_location_id": 3694895171,
          "price": "45.00",
          "product_id": 403505812906,
          "properties": null,
          "quantity": 1,
          "requires_shipping": true,
          "sku": "",
          "tax_lines": [
            {
              "position": 1,
              "price": "2.50",
              "rate": 0.1,
              "title": "GST",
              "source": "Shopify",
              "compare_at": 0.1,
              "zone": "country"
            }
          ],
          "taxable": true,
          "title": "Product 2",
          "variant_id": 1811171115218,
          "variant_title": "",
          "vendor": "mockshop"
        }
      ],
      "name": "#412087177642",
      "source": null,
      "discount_codes": [
        {
          "code": "SHOP20",
          "amount": "20.00",
          "type": "fixed_amount"
        }
      ],
      "abandoned_checkout_url": "https:\/\/www.mockshop.com\/22487111\/checkouts\/dd1ef332ef1edabfc2b8349c9554ea97\/recover?key=7a0a806edd124df32c7587a5c9557a7b",
      "tax_lines": [
        {
          "title": "GST",
          "price": "2.50",
          "rate": 0.1
        }
      ],
      "source_name": "web",
      "shipping_address": {
        "first_name": "Sarah",
        "address1": "91 Rosemary Avenue",
        "phone": "0400 000 001",
        "city": "Salisbury",
        "zip": "5000",
        "province": "South Australia",
        "country": "Australia",
        "last_name": "Tan",
        "address2": "",
        "company": "",
        "latitude": -1.9045728,
        "longitude": 2.5416054,
        "name": "Sarah Tan",
        "country_code": "AU",
        "province_code": "SA"
      },
      "customer": {
        "id": 98398142470,
        "email": "Sarah_tan@gmail.com",
        "accepts_marketing": false,
        "created_at": "2017-11-21T22:23:29+11:00",
        "updated_at": "2018-02-24T11:38:22+11:00",
        "first_name": "Sarah",
        "last_name": "Tan",
        "orders_count": 2,
        "state": "disabled",
        "total_spent": "59.50",
        "last_order_id": 129374388234,
        "note": null,
        "verified_email": true,
        "multipass_identifier": null,
        "tax_exempt": false,
        "phone": null,
        "tags": "",
        "last_order_name": "#1007",
        "default_address": {
          "id": 153119527434,
          "customer_id": 18314142472,
          "first_name": "Sarah",
          "last_name": "Tan",
          "company": null,
          "address1": "156 Mountain Street",
          "address2": "",
          "city": "North Ryde",
          "province": "New South Wales",
          "country": "Australia",
          "zip": "2070",
          "phone": "",
          "name": "Sarah Tan",
          "province_code": "NSW",
          "country_code": "AU",
          "country_name": "Australia",
          "default": true
        }
      }
    }
  ]
}
